[
  {
    "name": "Adaptive Architecture for Transient IoT Systems",
    "slug": "adaptive_architecture",
    "period": "2017-present",
    "researchLine": "iot",
    "url": "https://github.com/SELF-Software-Evolution-Lab/Adaptive-Architecture-for-Transient-IoT-Systems",
    "description": "Adaptation is crucial for the success of IoT systems since these are part of continuously changing environments. Changes may come from the different layers of an IOT system, either service, connectivity or physical layer. Most existing literature pays special attention to changes in the service layer leaving out the rest of the layers. In previous work, we have presented eight challenges that may impact the three layers of IoT systems. These challenges have served us as a research agenda to foster IoT systems. As a starting point, we chose two of these challenges –referred to as inclusion of new devices and devices’ transient connection– and designed a software architecture to adaptIoT systems to them. Various of the architectural components are inspired on a reference architecture, and complemented by new components to manage dynamic adaptations in response to the two selected challenges. Our solution has three pillars: i) ontologies and instances to represent the domain knowledge; ii) an algorithm that matches instances of services and IOT devices taking into account three perspectives (i.e., functional requirements, quality attributes and sensors properties); and iii) an algorithm that updates such matches whenever a change happens (e.g., sensor unavailability). Our results show a higher accuracy of the matching algorithm compared with that of existing approaches.",
    "summary": "Our solution has three pillars: i) ontologies and instances to represent the domain knowledge; ii) an algorithm that matches instances of services and IOT devices taking into account three perspectives (i.e., functional requirements, quality attributes and sensors properties); and iii) an algorithm that updates such matches whenever a change happens (e.g., sensor unavailability). Our results show a higher accuracy of the matching algorithm compared with that of existing approaches.",
    "status": "active",
    "members": [
      "ja.arizac1",
      "ca.mendoza968",
      "kj.garces971",
      "n.cardozo"
    ],
    "publications": [
      {
        "name": "Ariza, J., Mendoza, C., Garcés, K., & Cardozo, N. (2018). A Research Agenda for IoT Adaptive Architectures. In Multidisciplinary Digital Publishing Institute Proceedings (Vol. 2, No. 19, p. 1229).",
        "url": "https://www.mdpi.com/2504-3900/2/19/1229"
      }
    ]
  },
  {
    "name": "Issues Detection in the Continuous Integration Pipeline",
    "slug": "archid",
    "period": "2018-present",
    "researchLine": "comprehension",
    "description": "We propose a solution called ArchID (Architectural issues IDentification tool) that supports the reconstruction of software projects and the visualization of compliance to reference architectures. This solutions includes three main components. First, a rule conformance checker that analyzes the adherence to architectural rules and can also automatically create issues and bug entries in the Version Control System (VCS) of the project. Second, a component that uses evolutionary data to calculate possible hotspots in the projects, taking into different architectural and social metrics. Finally, we propose a visualization component that shows the projects with the prioritization made with the results of the previous components, that servers as a reconstruction of the architecture and a facilitator for decisions concerning the effort and future work on the projects analyzed. A validation of this solution was executed in the fall semester of 2019 with the students projects of a software development course in the Universidad de los Andes and a software project implemented by a software developing company.",
    "summary": "ArchID is a tool for the identification and visualization of problems in software projects related to the design decisions, technologies and frameworks used in each context. It allows the detection of problematic files inside a project, according to predefined rules that must be hand-coded into queries that traverse a higher-level model representation of the source code.",
    "status": "active",
    "members": [
      "ca.mendoza968",
      "kj.garces971",
      "rcasalla",
      "j.bocanegra"
    ],
    "publications": [
      {
        "name": "Mendoza, C., Garcés, K., Casallas, R., & Bocanegra, J. (2019, September). Detecting Architectural Issues During the Continuous Integration Pipeline. In 2019 ACM/IEEE 22nd International Conference on Model Driven Engineering Languages and Systems Companion (MODELS-C) (pp. 589-597). IEEE.",
        "url": "https://ieeexplore.ieee.org/abstract/document/8904593/"
      }
    ]
  },
  {
    "name": "IoT Systems for Coal Mines",
    "slug": "iot_mining",
    "period": "2018-present",
    "researchLine": "iot",
    "description": "Monitoring the concentration of gases in underground coal mines is a mandatory process that may save lives. Wireless Sensor Networks (WSNs) can alert mine personnel when dangerous levels of gases are detected, such as methane and carbon monoxide that may cause explosions or poisoning of workers. WSNs must be designed to cover all active mining areas throughout a specified time horizon, thus, posing a trade-off between the cost of installation (i.e., sensors) and operation (i.e., energy consumption). While most literature on node deployment for WSNs in mines focuses on single objective functions, we propose a novel two-stage approach that allows users to address both the cost of installation and the WSN lifetime: in the first stage, our model provides the lowest cost solution that satisfies a user-specified minimum lifetime; in the second stage, the configuration of the WSN is modified in order to maximize its lifetime, subject to maintaining the number of nodes (and, hence, installation costs) from the first stage. Illustrative examples are presented regarding two real coal mines in Boyaca (Colombia).",
    "summary": "An optimization methodology is proposed for the deployment of Wireless Sensor Networks to monitor gases in underground coal mining. The methodology addresses two objectives: minimizing deployment costs and maximizing WSN lifetime. The proposed methodology has been tested using two realistic case studies regarding mines in Boyacá. The algorithm implementation produces instantaneous results for realistically sized networks, indicating that the methodology is computationally adequate.",
    "status": "active",
    "members": [
      "kj.garces971",
      "id.alfonso"
    ],
    "publications": [
      {
        "name": "Alfonso, I., Goméz, C., Garcés, K., & Chavarriaga, J. (2018, May). Lifetime optimization of Wireless Sensor Networks for gas monitoring in underground coal mining. In 2018 7th International Conference on Computers Communications and Control (ICCCC) (pp. 224-230). IEEE.",
        "url": "https://ieeexplore.ieee.org/abstract/document/8390462"
      }
    ]
  },
  {
    "name": "Oracle Forms Modernization",
    "slug": "oracle_forms_modernization",
    "period": "2015-2018",
    "researchLine": "transformation",
    "description": "Software modernization consists of transforming legacy applications into modern technologies, mainly to minimize maintenance costs. This transformation often produces a new application that is a poor copy of the legacy due to the degradation of quality attributes, for example. This project presents a white-box transformation approach that changes the application architecture and the technological stack without losing business value and quality attributes. This approach obtains a technology agnostic model from the original sources, such a model facilitates the architecture configuration before performing the actual transformation of the application into the new technology. The architecture for the new application can be configured considering aspects such as data access, quality attributes, and process. We evaluate our approach through an industrial case study, the gist of which is the transformation of Oracle Forms applications—where the presentation layer is highly coupled to the data access layer—to multitiered applications.",
    "summary": "Software modernization consists of transforming legacy applications into modern technologies, mainly to minimize maintenance costs. This project presents a white-box transformation approach that changes the application architecture and the technological stack without losing business value and quality attributes. The architecture for the new application can be configured considering aspects such as data access, quality attributes, and process.",
    "status": "inactive",
    "members": [
      "kj.garces971",
      "rcasalla"
    ],
    "industry": [
      {
        "name": "Fabian Melo"
      },
      {
        "name": "Freddy Viera"
      },
      {
        "name": "Juan Manuel Soto"
      },
      {
        "name": "Alejandro Salamanca"
      },
      {
        "name": "Sandra Pinto"
      }
    ],
    "publications": [
      {
        "name": "Garcés, K., Casallas, R., Álvarez, C., Sandoval, E., Salamanca, A., Viera, F., ... & Soto, J. M. (2018). White-box modernization of legacy applications: The oracle forms case study. Computer Standards & Interfaces, 57, 110-122.",
        "url": "https://www.sciencedirect.com/science/article/abs/pii/S0920548916302227"
      },
      {
        "name": "Mendivelso, L. F., Garcés, K., & Casallas, R. (2018). Metric-centered and technology-independent architectural views for software comprehension. Journal of Software Engineering Research and Development, 6(1), 16.",
        "url": "https://jserd.springeropen.com/articles/10.1186/s40411-018-0060-6"
      },
      {
        "name": "Mendivelso, L. F., Garcés, K., & Casallas, R. (2017). Vistas arquitectónicas independientes de tecnología para compresión de software. In Proceedings of the 20th Conferencia Iberoamericana en Software Engineering (CIbSE 2017). Buenos Aires (pp. 71-84)."
      },
      {
        "name": "Garcés, K., Casallas, R., Álvarez, C., Sandoval, E., Salamanca, A., Melo, F., & Soto, J. M. (2016, September). White-Box Modernization of Legacy Applications. In International Conference on Model and Data Engineering (pp. 274-287). Springer, Cham.",
        "url": "https://link.springer.com/chapter/10.1007/978-3-319-45547-1_22"
      },
      {
        "name": "Garcés, K., Sandoval, E., Casallas, R., Alvarez, C., Salamanca, A., Pinto, S., & Melo, F. (2015). Aiming towards modernization: visualization to assist structural understanding of oracle forms applications. In Proceedings of the Tenth International Conference on Software Engineering Advances, ICSEA 2015 (pp. 86-95). IARIA.",
        "url": "https://www.researchgate.net/profile/Kelly_Garces/publication/301221556_Aiming_towards_Modernization_Visualization_to_Assist_Structural_Understanding_of_Oracle_Forms_Applications/links/570d3a5508ae2b772e431d2a/Aiming-towards-Modernization-Visualization-to-Assist-Structural-Understanding-of-Oracle-Forms-Applications.pdf"
      }
    ],
    "demos": [
      {
        "title": "Oracle Forms 6 Cartography Tool Overview V1",
        "id": "xfyqzALey24",
        "type": "youtube"
      }
    ]
  },
  {
    "name": "Ruby on Rails Modernization",
    "slug": "ror_modernization",
    "period": "2017",
    "researchLine": "transformation",
    "description": "Agile Development values working software over documentation. Therefore, in maintenance stages of existing software, the source code is the sole software artifact that developers have for analyzing the viability and impact of a new user story. Since functionality is often spread in hundreds of lines of code, it is hard for the developer to understand the system, which may lead to under-/overestimation of the new feature cost and rework/delays in the subsequent phases of development. In a previous work, we proposed a Model-Driven Reverse Engineering approach for obtaining software visualizations from source code. Two case studies of comprehension of applications written in statically typed languages have shown the applicability of this approach. A recent experience with an industrial partner, where the systems are developed on dynamically typed languages, has motivated us to adapt the previous proposal to take as input not only the source code but also the application data schema to complete the information that is missing in the code, and then automatically generate more meaningful diagrams that help developers in maintenance tasks. In this project, we present the adaptation of the general approach to support data schema as an additional input and its instrumentation in an industrial case study where the technology is Ruby on Rails.",
    "summary": "Since functionality is often spread in hundreds of lines of code, it is hard for the developer to understand the system, which may lead to under/overestimation of the new feature cost and rework/delays in the subsequent phases of development. In this project, we present the adaptation of the general approach to support data schema as an additional input and its instrumentation in an industrial case study where the technology is Ruby on Rails.",
    "status": "inactive",
    "members": [
      "kj.garces971",
      "j.garcia100"
    ],
    "publications": [
      {
        "name": "García, J., & Garcés, K. (2017, August). Improving understanding of dynamically typed software developed by agile practitioners. In Proceedings of the 2017 11th Joint Meeting on Foundations of Software Engineering (pp. 908-913). ACM.",
        "url": "https://dl.acm.org/citation.cfm?id=3117772"
      }
    ]
  },
  {
    "name": "Crystal Reports Modernization",
    "slug": "crystal_modernization",
    "period": "2018",
    "researchLine": "transformation",
    "description": "Currently, we are experiencing great advances in various fields of technology such as hardware and software. These advances propose various challenges in software engineering in order to face the maintainability and support of current systems. The cases of software that become obsoleted by this accelerated process of evolution involves increasingly complex procedural challenges of migrations and updates. A clear example are reporting systems which are an essential support for companies. It is important to build solutions and tools that leverage efficient migration process. In this paper, we present a model-based approach to cover the migration scenario of reports from Crystal to Oracle Publisher. The approach relies on three pillars: i) a view with the results of a function point analysis that aims at facilitating planning task; ii) a structural view of the reports that allows developers to restructure them and see the migration progress status; and iii) the actual transformation from Crystal to Publisher. An evaluation of the approach on a real dataset shows their advantages in term of developers' productivity and report performance improvements.",
    "summary": "Currently, we are experiencing great advances in various fields of technology such as hardware and software. A clear example are reporting systems which are an essential support for companies. The approach relies on three pillars: i) a view with the results of a function point analysis that aims at facilitating planning task; ii) a structural view of the reports that allows developers to restructure them and see the migration progress status; and iii) the actual transformation from Crystal to Publisher.",
    "status": "inactive",
    "members": [
      "kj.garces971"
    ]
  },
  {
    "name": "JEE and Microservices Modernization",
    "slug": "jee_modernization",
    "period": "2016",
    "researchLine": "transformation",
    "description": "Nowadays, software development teams face the challenge of maintenance and evolution of large applications. This is known as modernization and comprises a process of understanding the existing application, and a process of transforming from the as-is state to the to-be state. In this project, we present an approach to modernize legacy applications into microservices. We propose a model-centered process to analyze and visualize the current structure and dependencies between the business layer and the data layer. Furthermore, we propose a modularization into clusters and microservices using four different diagrams. To validate our approach we have analyzed a JEE application with over 74566 LoC. The results show that the understanding is greatly improved through the diagrams proposed, and the modularization proposed constitutes the first step towards the automated modernization of the application.",
    "summary": "In this project, we present an approach to modernize legacy applications into microservices. We propose a model-centered process to analyze and visualize the current structure and dependencies between the business layer and the data layer. Furthermore, we propose a modularization into clusters and microservices using four different diagrams.",
    "status": "inactive",
    "members": [
      "kj.garces971",
      "rcasalla"
    ],
    "publications": [
      {
        "name": "Escobar, D., Cárdenas, D., Amarillo, R., Castro, E., Garcés, K., Parra, C., & Casallas, R. (2016, October). Towards the understanding and evolution of monolithic applications as microservices. In 2016 XLII Latin American Computing Conference (CLEI) (pp. 1-11). IEEE.",
        "url": "https://ieeexplore.ieee.org/abstract/document/7833410/"
      }
    ]
  },
  {
    "name": "Mining of Model to Model Transformation Repositories",
    "slug": "m2m_mining",
    "period": "2017-2018",
    "researchLine": "transformation",
    "description": "Bad smells affect maintainability and performance of model-to-model transformations. There are studies that define a set of transformation bad smells, and some of them propose techniques to recognize and–according to their complexity–fix them in a (semi)automated way. In academia it is necessary to make students aware of this subject and provide them with guidelines to improve the quality of their transformations. This paper presents the most common bad smells made by master students from Universidad de los Andes, and compares them with those from publicly available repositories of Epsilon transformation language transformations, with the purpose of knowing whether programming style affects the incidence of smells. Three concrete contributions are presented: (i) two new bad smells that enrich the existing catalogs; (ii) a process that includes the automated extraction of transformation metrics and bad smells metrics from the repositories, and a statistical analysis that helps in identifying the relation between such metrics; and (iii) a tool that automatizes the process. From the statistical analysis, we conclude that, students must be encouraged and guided to develop maintainable declarative transformations. At this point, our tool has been proved to be very useful to help improve the quality of students’ transformations.",
    "summary": "This project presents the most common bad smells made by master students from Universidad de los Andes, and compares them with those from publicly available repositories of Epsilon transformation language transformations, with the purpose of knowing whether programming style affects the incidence of smells. From the statistical analysis, we conclude that, students must be encouraged and guided to develop maintainable declarative transformations. At this point, our tool has been proved to be very useful to help improve the quality of students’ transformations.",
    "status": "inactive",
    "members": [
      "kj.garces971",
      "rcasalla"
    ],
    "publications": [
      {
        "name": "Bonet, N., Garcés, K., Casallas, R., Correal, M. E., & Wei, R. (2018). Influence of programming style in transformation bad smells: mining of ETL repositories. Computer Science Education, 28(1), 87-108.",
        "url": "https://www.tandfonline.com/doi/abs/10.1080/08993408.2018.1472950"
      },
      {
        "name": "Bonet N, Garces K, Casallas R, Correal M, Ran W. (2017) Influence of Programming Style in Transformation Bad Smells: Mining of ETL Repositories. CEUR Workshop Proceedings (ISSN 1613-0073) Estados Unidos. - 2017",
        "url": "http://ceur-ws.org/Vol-2019/edusymp_5.pdf"
      }
    ]
  },
  {
    "name": "IoT Systems for Predictive Maintenance in Industry 4.0",
    "slug": "predictive_maintenance",
    "period": "2019",
    "researchLine": "iot",
    "description": "In the Industry 4.0 vision, Prognostics and Health Management (PHM) is expected to assist domain experts in the generation of maintenance decisions. PHM relies on the processing of data sensed from the manufacturing plant for inferring the future performance of production systems. The acquisition and management of data brings different challenges such as data integration, heterogeneity, search usability and volume. To be best of authors' knowledge, an information system for sharing maintenance data able to fulfill the aforementioned challenges is not available yet. XRepo is proposed within this paper and faces three of the identified challenges through selected functionality: i) Heterogeneity: stored data is complaint with a standard format that includes the information necessary for performing PHM analysis; ii) Integration: data is uploaded to the repository through files or web services; iii) Search usability: stored data can be filtered by criteria and downloaded. This work is meant to be an initial effort towards the generation of a common information system for PHM analysis.",
    "summary": "To be best of authors knowledge, an information system for sharing maintenance data able to fulfill the aforementioned challenges is not available yet.\n\nXRepo is proposed within this paper and faces three of the identified challenges through selected functionality: i) Heterogeneity: stored data is complaint with a standard format that includes the information necessary for performing PHM analysis; ii) Integration: data is uploaded to the repository through files or web services; iii) Search usability: stored data can be filtered by criteria and downloaded.",
    "status": "inactive",
    "members": [
      "kj.garces971",
      "n.cardozo"
    ],
    "publications": [
      {
        "name": "Ardila A, Martinez F, Garces K, Barbieri G, Sanchez D, Caielli A, Cattaneo L, Fumagalli L. (2019) Xrepo - Towards an information system for prognostics and health management analysis. International conference on industry 4.0 and smart manufacturing (ISM) Cosenza, Italia"
      }
    ]
  }
]